results/mixed_memc_redis_20251208-171931/memtier_memcached.log
Json file ../results/mixed_memc_redis_20251208-171931/memtier_memcached.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #1)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #1)...
Thread 1 restarted successfully.
Connection error: Connection refused
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #2)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #2)...
Thread 1 restarted successfully.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #3)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #3)...
Thread 1 restarted successfully.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #4)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #4)...
Thread 1 restarted successfully.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #5)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #5)...
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Connection error: Connection refused
Maximum reconnection attempts (0) exceeded for Connection error, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
[RUN #1 0%,   0 secs]  0 threads  8 conns 2 conn errors:           0 ops,       0 (avg:       0) ops/sec, 0.00KB/sec (avg: 0.00KB/sec),  0.00 (avg:  0.00) msec latency

Saving JSON output file: ../results/mixed_memc_redis_20251208-171931/memtier_memcached.json
Json file closed.
2         Threads
8         Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p90 Latency     p99 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            -nan          ---          ---             ---             ---             ---             ---         -nan 
Gets            -nan         -nan         -nan             ---             ---             ---             ---         -nan 
Waits           -nan          ---          ---             ---             ---             ---             ---          --- 
Totals          -nan         -nan         -nan            -nan         0.00700         0.00700         0.00700         -nan